app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "yo"], ["user_id", ""], ["post_id", "151081805"], ["created_at", "2023-03-05 09:09:28.315387"], ["updated_at", "2023-03-05 09:09:28.315387"]]