app/controllers/posts_controller.rb

  def myposts
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("id", "title", "description", "keywords", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)