app/models/post.rb

SELECT 1 AS one FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 671048717], ["LIMIT", 1]]
---
    def randomize_id
      begin
        self.id = SecureRandom.random_number(1_000_000_000)
      end while User.where(id: self.id).exists?