app/models/user.rb

        def randomize_id
          begin
            self.id = SecureRandom.random_number(1_000_000_000)
          end while User.where(id: self.id).exists?
---
SELECT 1 AS one FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 620604776], ["LIMIT", 1]]